Gregification/BeeMS/MB_MSPM0G3507_A/src/Core/system.cpp
        spi1._trxBuffer.rx_i = -1;

        NVIC_EnableIRQ(spi1.irq_type);
        DL_SPI_enableInterrupt(spi1.reg,
                  DL_SPI_INTERRUPT_RX
                | DL_SPI_INTERRUPT_TX
                | DL_SPI_INTERRUPT_IDLE
            );
    }
    #endif


    #ifdef PROJECT_ENABLE_MCAN0
    {
        DL_MCAN_enableModuleClock(CANFD0);

        {
            static_assert(System::CLK::CANCLK == 80e6, "CAN peripheral clock misconfigured"); // adjust the dividers so that the clock is either 20MHz,40MHz, or 80MHz
            static DL_MCAN_ClockConfig clkConfig = {
               .clockSel= DL_MCAN_FCLK::DL_MCAN_FCLK_SYSPLLCLK1,
               .divider = DL_MCAN_FCLK_DIV::DL_MCAN_FCLK_DIV_1,
            };
            DL_MCAN_setClockConfig(CANFD0, &clkConfig);

        }

        // have no idea if this is required for the setup
        DL_MCAN_RevisionId revId;
        /* Get MCANSS Revision ID. */
        DL_MCAN_getRevisionId(CANFD0, &revId);

        /* Wait for Memory initialization to be completed. */
        while(false == DL_MCAN_isMemInitDone(CANFD0))
            ;

        /* Put MCAN in SW initialization mode. */
        DL_MCAN_setOpMode(CANFD0, DL_MCAN_OPERATION_MODE_SW_INIT);
        while(DL_MCAN_OPERATION_MODE_SW_INIT != DL_MCAN_getOpMode(CANFD0))
            ;

        { /* Initialize MCAN module. */
            constexpr DL_MCAN_InitParams initparam = {
                  /* Initialize MCAN Init parameters.    */
                  .fdMode            = true,    // CAN FD mode?
                  .brsEnable         = true,    // enable bit rate switching?
                  .txpEnable         = true,    // pause for 2 bit times after successful transmission?
                  .efbi              = false,   // edge filtering? 2 consecutive Tq to accept sync
                  .pxhddisable       = false,   // do not Tx error frame on protocol error?
                  .darEnable         = true,    // auto retransmission of failed frames?
                  .wkupReqEnable     = false,   // enable wake up request?
                  .autoWkupEnable    = false,   // enable auto-wakeup?
                  .emulationEnable   = false,
                  .wdcPreload        = 255,     // start value of message ram WDT

                  /* Transmitter Delay Compensation parameters. tm.26.4.6/1439 */
                  .tdcEnable         = false,   // transmitter delay compensation
                  .tdcConfig.tdcf    = 10,      // filter length
                  .tdcConfig.tdco    = 6,       // filter offset
                };
            DL_MCAN_init(CANFD0, &initparam);
        }

        { /* Configure MCAN module. */

            /* background rule for packet filter, unknown stuff goes
             * in the operational fifo
             */
            constexpr DL_MCAN_GlobalFiltConfig backgroundFilter = {
                  .rrfe = 1,
                  .rrfs = 1,
                  .anfe = CANFD::OP_RXFIFO  == DL_MCAN_RX_FIFO_NUM_0 ? 0 : CANFD::OP_RXFIFO  == DL_MCAN_RX_FIFO_NUM_1 ? 1 : 67,
                  .anfs = CANFD::OP_RXFIFO  == DL_MCAN_RX_FIFO_NUM_0 ? 0 : CANFD::OP_RXFIFO  == DL_MCAN_RX_FIFO_NUM_1 ? 1 : 67,
            };

            constexpr DL_MCAN_ConfigParams config = {
                    .monEnable         = false,     // bus monitoring mode
                    .asmEnable         = false,     // restricted operation mode
                    .tsPrescalar       = 15,        // timestamp counter prescalar
                    .tsSelect          = 0,         // timestamp source selection
                    .timeoutSelect     = DL_MCAN_TIMEOUT_SELECT_CONT, // timeout source select
                    .timeoutPreload    = 65535,     // load value of timeout counter
                    .timeoutCntEnable  = false,     // timeout counter enable
                    .filterConfig       = backgroundFilter,
                };
            DL_MCAN_config(CANFD0, &config);
        }

        { /* Configure Bit timings. */
            // arb 500k, data 500k
//            constexpr DL_MCAN_BitTimingParams   bitTimeingParams = {
//                    .nomRatePrescalar   = 4,    /* Arbitration Baud Rate Pre-scaler. */
//                    .nomTimeSeg1        = 26,   /* Arbitration Time segment before sample point. */
//                    .nomTimeSeg2        = 3,    /* Arbitration Time segment after sample point. */
//                    .nomSynchJumpWidth  = 3,    /* Arbitration (Re)Synchronization Jump Width Range. */
//                    .dataRatePrescalar  = 4,    /* Data Baud Rate Pre-scaler. */
//                    .dataTimeSeg1       = 26,    /* Data Time segment before sample point. */
//                    .dataTimeSeg2       = 3,    /* Data Time segment after sample point. */
//                    .dataSynchJumpWidth = 3,    /* Data (Re)Synchronization Jump Width.   */
//                };
            // arb 500k, data 2M
            constexpr DL_MCAN_BitTimingParams   bitTimeingParams = {
                    .nomRatePrescalar   = 1,    /* Arbitration Baud Rate Pre-scaler. */
                    .nomTimeSeg1        = 68,   /* Arbitration Time segment before sample point. */
                    .nomTimeSeg2        = 9,    /* Arbitration Time segment after sample point. */
                    .nomSynchJumpWidth  = 9,    /* Arbitration (Re)Synchronization Jump Width Range. */
                    .dataRatePrescalar  = 1,    /* Data Baud Rate Pre-scaler. */
                    .dataTimeSeg1       = 16,    /* Data Time segment before sample point. */
                    .dataTimeSeg2       = 1,    /* Data Time segment after sample point. */
                    .dataSynchJumpWidth = 1,    /* Data (Re)Synchronization Jump Width.   */
                };

            DL_MCAN_setBitTime(CANFD0, &bitTimeingParams);
        }

        { /* Configure Message RAM Sections & filter elements*/
            constexpr DL_MCAN_MsgRAMConfigParams ramConfig = {
                .flssa                = 0,
                .lss                  = 2,
                .flesa                = 8,
                .lse                  = 4,
                /* Tx Section: 1 dedicated + 7 fifo elements @ 64 bytes*/
                .txStartAddr          = 40,
                .txBufNum             = 1,
                .txFIFOSize           = 7,
                .txBufMode            = 0,          // 0 : fifo , 1 : queue
                .txBufElemSize        = DL_MCAN_ELEM_SIZE_64BYTES,
                /* Event FIFO: unused, empty */
                .txEventFIFOStartAddr = 616,
                .txEventFIFOSize      = 0,
                .txEventFIFOWaterMark = 0,
                /* Rx FIFO 0: 3 elements @ 64 bytes */ //MODBUS_RXFIFO
                .rxFIFO0startAddr     = 616,
                .rxFIFO0size          = 3,
                .rxFIFO0waterMark     = 0,
                .rxFIFO0OpMode        = 0,
                .rxFIFO0ElemSize      = DL_MCAN_ELEM_SIZE_64BYTES,
                /* Rx FIFO 1: 6 elements @ 20 bytes */ //OP_RXFIFO
                .rxFIFO1startAddr     = 832,
                .rxFIFO1size          = 6,
                .rxFIFO1waterMark     = 0,
                .rxFIFO1OpMode        = 0,
                .rxFIFO1ElemSize      = DL_MCAN_ELEM_SIZE_20BYTES,
                /* Dedicated Rx Buffers: unused*/
                .rxBufStartAddr       = 1000,
                .rxBufElemSize        = DL_MCAN_ELEM_SIZE_20BYTES,
            };
            static_assert(CANFD::MODBUS_RXFIFO  == DL_MCAN_RX_FIFO_NUM_0);
            static_assert(CANFD::OP_RXFIFO      == DL_MCAN_RX_FIFO_NUM_1);

