Gregification/BeeMS/MB_MSPM0G3507_A/src/Core/system.cpp
        str[i] = c;

        switch(c){
            case '\0':
            case '\n':
            case '\r':
                if(i == n)
                    str[i] ='\0';
                else
                    str[i+1] ='\0';
                return i;

            case '\b':
                i -= 2;
        }

        DL_UART_transmitDataBlocking(reg, c);
    }
    return i ;
}

void System::UART::UART::put32d(int32_t v) {
    char str[12];
    int i = 0;

    if (v < 0) {
        DL_UART_transmitDataBlocking(reg, '-');
        v = -v;
    }

    if (v == 0) {
        DL_UART_transmitDataBlocking(reg, '0');
        return;
    }

    for(i = 0; v > 0; i++){
        str[i] = '0' + (v % 10);
        v /= 10;
    }

    i--;
    for(; i >= 0; i--){
        DL_UART_transmitDataBlocking(reg, str[i]);
    }
}

void System::UART::UART::putu32d(uint32_t v) {
    if(v == 0){
        DL_UART_transmitDataBlocking(reg, '0');
        return;
    }

    char str[10];
    int i;
    for(i = 0; v > 0; i++){
        str[i] = '0' + (v % 10);
        v /= 10;
    }
    i--;
    for(; i >= 0; i--){
        DL_UART_transmitDataBlocking(reg, str[i]);
    }
}

void System::UART::UART::putu32h(uint32_t v) {
    int started = 0;

    int i;
    DL_UART_transmitDataBlocking(reg, '0');
    DL_UART_transmitDataBlocking(reg, 'x');
    for (i = 28; i >= 0; i -= 4) {
        uint8_t B = (v >> i) & 0xF;

        if (B != 0 || started || i == 0) {
            started = 1;
            if (B < 10)
                DL_UART_transmitDataBlocking(reg, '0' + B);
            else
                DL_UART_transmitDataBlocking(reg, 'A' + (B - 10));
        }
    }
}

void System::SPI::SPI::setSCLKTarget(uint32_t target, uint32_t clk){
    uint32_t t = clk / target;
    if(clk - t * target)
        t++;
    DL_SPI_setBitRateSerialClockDivider(reg, t+1); // eh
}

void System::SPI::SPI::_irq() {
    DL_SPI_IIDX intr = DL_SPI_getPendingInterrupt(reg);
    switch(intr){
        case DL_SPI_IIDX::DL_SPI_IIDX_IDLE:
        case DL_SPI_IIDX::DL_SPI_IIDX_RX:
            while(!DL_SPI_isRXFIFOEmpty(reg)){
                if(_trxBuffer.rx_i < _trxBuffer.len){
                    if(_trxBuffer.rx)
                        _trxBuffer.rx[_trxBuffer.rx_i] = DL_SPI_receiveData8(reg);
                    else
                        DL_SPI_receiveData8(reg);
                    _trxBuffer.rx_i++;
                } else {
                    // ignore and flush
                    DL_SPI_receiveData8(reg);
                }
            }

            if(_trxBuffer.cs && !DL_SPI_isBusy(reg) && (
                    (!_trxBuffer.tx || (_trxBuffer.tx_i >= _trxBuffer.len))
                &&  (!_trxBuffer.rx || (_trxBuffer.rx_i >= _trxBuffer.len))
              )) {
                _trxBuffer.cs->clear();
                _trxBuffer.cs = NULL;
            }

            break;

            // transmit more stuff
        case DL_SPI_IIDX::DL_SPI_IIDX_TX:
            if(_trxBuffer.tx_i < _trxBuffer.len){ // anything left to TX?
                if(_trxBuffer.tx) { // TX array contents
                    _trxBuffer.tx_i +=  DL_SPI_fillTXFIFO8(
                            reg,
                            _trxBuffer.tx + _trxBuffer.tx_i,
                            _trxBuffer.len - _trxBuffer.tx_i
                        );
                } else { // TX bogus data
                    for(; (_trxBuffer.tx_i < _trxBuffer.len) && !DL_SPI_isTXFIFOFull(reg); _trxBuffer.tx_i++){
                        DL_SPI_transmitData8(reg, TRANSFER_FILLER_BYTE);
                    }
                }
            }

            break;

        default:
            break;

    };
}

void System::SPI::SPI::transfer_blocking(void * tx, void * rx, buffersize_t len, System::GPIO::GPIO const * cs){
    transfer(tx,rx,len,cs);
    while(isBusy())
        vTaskDelay(0);
    if(cs){ // extra fast clear
        cs->clear();
    }
}

void System::SPI::SPI::transfer(void * tx, void * rx, buffersize_t len, System::GPIO::GPIO const * cs){
    while(isBusy()) {
        vTaskDelay(0);
    }

    _trxBuffer.tx = (uint8_t *) tx;
    _trxBuffer.rx = (uint8_t *) rx;
    _trxBuffer.len = len;
    _trxBuffer.cs = cs;
    _trxBuffer.tx_i = 0;

    if(_trxBuffer.cs)
        _trxBuffer.cs->set();

    if(_trxBuffer.rx)
        _trxBuffer.rx_i = 0;
    else
        _trxBuffer.rx_i = _trxBuffer.tx_i;

    // start IRQ handlers
    reg->CPU_INT.ISET |= SPI_CPU_INT_ISET_TX_SET;
    NVIC_SetPendingIRQ(irq_type);
}

bool System::SPI::SPI::isBusy() {
    return      (_trxBuffer.tx && (_trxBuffer.tx_i < _trxBuffer.len))
            ||  (_trxBuffer.rx && (_trxBuffer.rx_i < _trxBuffer.len))
            ||  DL_SPI_isBusy(reg);
}

void System::I2C::I2C::setSCLTarget(uint32_t target, uint32_t clk){
    DL_I2C_ClockConfig clk_config;
    DL_I2C_getClockConfig(reg, &clk_config);

    // if clk too slow
    if(target * 20 > clk){
        clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_1;
        DL_I2C_setClockConfig(reg, &clk_config);
    }

    uint32_t effective_clk;
    do {
        effective_clk = clk;
        switch(clk_config.divideRatio){
            default:
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_1: effective_clk /= 1; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_2: effective_clk /= 2; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_3: effective_clk /= 3; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_4: effective_clk /= 4; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_5: effective_clk /= 5; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_6: effective_clk /= 6; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_7: effective_clk /= 7; break;
            case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_8: effective_clk /= 8; break;
        }

        // if clk too fast
        if((effective_clk / (target * 10) - 1) > BV(5) && (clk_config.divideRatio != DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_8)) {

