Gregification/BeeMS/MB_MSPM0G3507_A/src/Core/system.cpp
            // increase divider and see if that works
            switch(clk_config.divideRatio){
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_1: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_2; break;
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_2: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_3; break;
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_3: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_4; break;
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_4: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_5; break;
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_5: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_6; break;
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_6: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_7; break;
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_7: clk_config.divideRatio = DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_8; break;
                default:
                case DL_I2C_CLOCK_DIVIDE::DL_I2C_CLOCK_DIVIDE_8: break;
            }
            DL_I2C_setClockConfig(reg, &clk_config);
        } else
            break;

    }while (true);

    DL_I2C_setTimerPeriod(reg, effective_clk / (target * 10) - 1);
}

bool System::I2C::I2C::tx_blocking(uint8_t addr, void * data, buffersize_t size, TickType_t) {
    bool ret = true;
    /*
     * Fill FIFO with data. This example will send a MAX of 8 bytes since it
     * doesn't handle the case where FIFO is full
     */
    DL_I2C_fillControllerTXFIFO(reg, (uint8_t *)data, size);

    /* Wait for I2C to be Idle */
    while (!(DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_IDLE))
        vTaskDelay(0);

    /* Send the packet to the controller.
     * This function will send Start + Stop automatically.
     */
    DL_I2C_startControllerTransfer(reg, addr,
        DL_I2C_CONTROLLER_DIRECTION_TX, size);

    /* Poll until the Controller writes all bytes */
    while (DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_BUSY_BUS)
        vTaskDelay(0);

    /* Trap if there was an error */
    if (DL_I2C_getControllerStatus(reg) &
        DL_I2C_CONTROLLER_STATUS_ERROR) {
        ret = false;
    }

    /* Wait for I2C to be Idle */
    while (!(DL_I2C_getControllerStatus(reg) & DL_I2C_CONTROLLER_STATUS_IDLE))
        vTaskDelay(0);

    /* Add delay between transfers */
    delay_cycles(1000);

    return ret;
}

bool System::I2C::I2C::rx_blocking(uint8_t addr, void * data, buffersize_t size, TickType_t) {
    /* Send a read request to Target */
    DL_I2C_startControllerTransfer(reg, addr,
        DL_I2C_CONTROLLER_DIRECTION_RX, size);

    /*
     * Receive all bytes from target. LED will remain high if not all bytes
     * are received
     */
    for (uint8_t i = 0; i < size; i++) {
        while (DL_I2C_isControllerRXFIFOEmpty(reg))
            vTaskDelay(0);
        ((uint8_t *)data)[i] = DL_I2C_receiveControllerData(reg);
    }

    return true;
}

void System::CANFD::CANFD::emptyRXFIFO(DL_MCAN_RX_FIFO_NUM fifonum) {
    DL_MCAN_RxFIFOStatus rf;
    rf.num = fifonum;

    while(true) {
        DL_MCAN_getRxFIFOStatus(reg, &rf);
        if(rf.fillLvl == 0)
            break;
        DL_MCAN_writeRxFIFOAck(reg, rf.num, rf.getIdx);
    }

}

uint8_t System::CANFD::DLC2Len(DL_MCAN_RxBufElement const * ele) {
    if(ele->dlc < 9)
        return ele->dlc;

    if(ele->fdf)
        switch(ele->dlc) {
            case 9:     return 12;
            case 10:    return 16;
            case 11:    return 20;
            case 12:    return 24;
            case 13:    return 32;
            case 14:    return 48;
            case 15:    return 64;
            default:    return 0;
        }
    else
        return 8;
}

uint8_t System::CANFD::DLC2Len(DL_MCAN_TxBufElement const * ele) {
    if(ele->dlc < 9)
        return ele->dlc;

    if(ele->fdf)
        switch(ele->dlc) {
            case 9:     return 12;
            case 10:    return 16;
            case 11:    return 20;
            case 12:    return 24;
            case 13:    return 32;
            case 14:    return 48;
            case 15:    return 64;
            default:    return 0;
        }
    else
        return 8;
}

uint32_t System::CANFD::len2DLC(uint32_t size) {
    if(size < 9)    return size;
    if(size <= 12)  return 9;
    if(size <= 16)  return 10;
    if(size <= 20)  return 11;
    if(size <= 24)  return 12;
    if(size <= 32)  return 13;
    if(size <= 48)  return 14;
    return 15;
}

uint32_t System::CANFD::getID(DL_MCAN_RxBufElement const & pkt) {
    if(pkt.xtd)
        return pkt.id & 0x1FFF'FFFF;

    return (pkt.id & 0x1FFC'0000) >> 18;
}

uint32_t System::CANFD::getID(DL_MCAN_TxBufElement const & pkt) {
    if(pkt.xtd)
        return pkt.id & 0x1FFF'FFFF;

    return (pkt.id & 0x1FFC'0000) >> 18;
}

/*--- Peripheral IRQ assignment --------------------------------------------------------*/
/* most peripherals don't need a IRQ
 */

#ifdef PROJECT_ENABLE_SPI0
    extern "C" void SPI0_IRQHandler(void){ System::SPI::spi0._irq(); }
#endif
#ifdef PROJECT_ENABLE_SPI1
    extern "C" void SPI1_IRQHandler(void){ System::SPI::spi1._irq(); }
#endif


    // for ease of debugging. delete if needed
//    /*
    extern "C" void NMI_Handler(void)
    { while(1){} }
    extern "C" void HardFault_Handler(void) // if this is giving u a problem check if your using IRQ safe funcitons in your IRQ
    { while(1){
        System::UART::uart_ui.nputs(ARRANDN("HARD FAULT" NEWLINE));
        delay_cycles(System::CLK::CPUCLK);
    } }
    extern "C" void GROUP0_IRQHandler(void)
    { while(1){} }
    extern "C" void GROUP1_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG8_IRQHandler(void)
    { while(1){} }
    extern "C" void UART3_IRQHandler(void)
    { while(1){} }
    extern "C" void ADC0_IRQHandler(void)
    { while(1){} }
    extern "C" void ADC1_IRQHandler(void)
    { while(1){} }
    extern "C" void CANFD0_IRQHandler(void)
    { while(1){} }
    extern "C" void DAC0_IRQHandler(void)
    { while(1){} }
    extern "C" void UART1_IRQHandler(void)
    { while(1){} }
    extern "C" void UART2_IRQHandler(void)
    { while(1){} }
    extern "C" void UART0_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG0_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG6_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMA0_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMA1_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG7_IRQHandler(void)
    { while(1){} }
    extern "C" void TIMG12_IRQHandler(void)
    { while(1){} }
    extern "C" void I2C0_IRQHandler(void)
    { while(1){} }
    extern "C" void AES_IRQHandler(void)
    { while(1){} }
    extern "C" void RTC_IRQHandler(void)
    { while(1){} }
    extern "C" void DMA_IRQHandler(void)
    { while(1){} }
//    */

/*--- idiot detection ------------------------------------------------------------------*/

//#if !defined(PROJECT_ENABLE_UART0)
//    #error "uart0 should always be enabled and used for the UI. better be a good reason otherwise."
    /* uart0 is used by the LP */
//#endif

// i fear for the day this happens
static_assert(pdTRUE == true,
        "pdTRUE != true . the FreeRTOS definition of \"true\" is not the same value as c/c++s \
        definition. code probably wont work. maybe FreeRTOS files were edited. consider reinstall."
    );
static_assert(pdFALSE == false,
        "pdFALSE != false . the FreeRTOS definition of \"false\" is not the same value as c/c++s \
        definition. code probably wont work. maybe FreeRTOS files were edited. consider reinstall."
    );

#ifdef MSPM0G3507_LQFP64
    #define MSPM0G3507_FOOTPRINT_C0 1
#else
    #define MSPM0G3507_FOOTPRINT_C0 0
#endif
#ifdef MSPM0G3507_LQFP48
    #define MSPM0G3507_FOOTPRINT_C1 1
#else
    #define MSPM0G3507_FOOTPRINT_C1 0
#endif
#ifdef MSPM0G3507_VQFN48
    #define MSPM0G3507_FOOTPRINT_C2 1
#else
    #define MSPM0G3507_FOOTPRINT_C2 0
#endif
#ifdef MSPM0G3507_VQFN32
    #define MSPM0G3507_FOOTPRINT_C3 1
#else
    #define MSPM0G3507_FOOTPRINT_C3 0
#endif
#ifdef MSPM0G3507_VSSOP28
    #define MSPM0G3507_FOOTPRINT_C4 1
#else
    #define MSPM0G3507_FOOTPRINT_C4 0
#endif
// Total number of footprints selected
#define MSPM0G3507_FOOTPRINT_TOTAL ( \
    MSPM0G3507_FOOTPRINT_C0 + \
    MSPM0G3507_FOOTPRINT_C1 + \
    MSPM0G3507_FOOTPRINT_C2 + \
    MSPM0G3507_FOOTPRINT_C3 + \
    MSPM0G3507_FOOTPRINT_C4 )
#if MSPM0G3507_FOOTPRINT_TOTAL == 0
    #error "No MSPM0G3507 variant defined. Must define exactly one."
#elif MSPM0G3507_FOOTPRINT_TOTAL > 1
    #error "Multiple MSPM0G3507 variants defined. Can only define one."
    // macros are at top of the header file
#endif
